Repository: punktDe/TYPO3.ext.th_rating
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# stepnames.bad
source: Bad
de: Schlecht

# stepnames.better
source: Better
de: Besser

# stepnames.good
source: Good
de: Gut

# stepnames.best
source: Best
de: Beste

# flexform.sheet_general
source: General
de: Basis

# flexform.general_actions
source: Plugin action
de: Aktion des Plugins

# flexform.general_actions_1
source: Display
de: Ansicht

# flexform.general_actions_2
source: Ratinglinks
de: Bewertungsverknüpfungen

# flexform.general_actions_3
source: Voteform
de: Bewertungsformular

# flexform.general_actions_5
source: Polling
de: Abstimmung

# flexform.general_actions_6
source: Mark
de: Markieren

# flexform.general_display
source: Ratinglink configuration
de: Ratinglink Darstellung

# flexform.general_showNotRated
source: Show info if no rating has be done yet
de: Zeige Info, wenn noch keine Bewertung erfolgte

# flexform.general_cookieLifetime
source: Enter value to activate cookie protection for anonymous votes
de: Wert zur Aktivierung von Cookies bei anonymen Bewertungen

# flexform.fluid.ratinglinksConfig
source: Ratinglink Views
de: Ratinglink Ansicht

# flexform.fluid.layoutConfig
source: General display
de: Generelle Anzeigeeinstellung

# flexform.fluid.layoutConfig_showSummary
source: Show overall rating summary
de: Bewertungszusammenfassung anzeigen

# flexform.fluid.layoutConfig_showCurrentRates
source: Show users given rating
de: Bewertung des Anwenders anzeigen

# flexform.fluid.layoutConfig_showSectionContent
source: Display action module content section
de: Inhaltsbereich des Aktionsmoduls anzeigen

# flexform.fluid.partialInfoBlockConfig_showAnonymousVotes
source: Display given anonymous votings
de: Anonyme Bewertung anzeigen

# flexform.fluid.partialUsersRatingConfig_showTextInfo
source: Display given users voting (text)
de: Bewertung des Anwenders als Text anzeigen

# flexform.fluid.partialUsersRatingConfig_showGraphicInfo
source: Display given users voting (graphic)
de: Bewertung des Anwenders als Grafik anzeigen

# flexform.fluid.ratinglinksConfig_tooltips
source: Show HTML generated tooltips on ratinglinks
de: HTML tooltips bei Ratinglinks anzeigen

# flexform.fluid.ratinglinksConfig_likesMode
source: likesMode activated
de: likesMode aktivieren

# flexform.sheet_paths
source: Paths
de: Pfade

# flexform.paths_templateRootPath
source: Template root path
de: Wurzelverzeichnis für Templates

# flexform.paths_partialRootPath
source: Partial root path
de: Wurzelverzeichnis für Partials

# flexform.paths_layoutRootPath
source: Layout root path
de: Wurzelverzeichnis für Layouts

# tca.BE.new
source: New
de: Neu

# tca.BE.unknown
source: Unknown
de: Unbekannt

# tca.BE.all
source: All
de: Alle

# tca.BE.default
source: Default
de: Standard

# tca.model.rating.ratingobject
source: Ratingobject
de: Bewertungsobjekt

# tca.model.rating.ratedobjectuid
source: Rated Object Uid
de: UID des bewerteten Objekts

# tca.model.rating.votes
source: Votes
de: Bewertungen

# tca.model.rating.currentrates
source: Calculated values
de: Berechnete Bewertung

# tca.model.rating.uid
source: Rating list
de: UID der Bewertung

# tca.model.rating.title
source: Rating
de: Bewertung

# tca.model.ratingobject.ratetable
source: Rating Object Tablename
de: Tabellenname des Bewertungsobjekts

# tca.model.ratingobject.ratefield
source: Rating Object Fieldname
de: Feldname des Bewertungsobjekts

# tca.model.ratingobject.ratingobject
source: Rating object list
de: Bewertungsobjektliste

# tca.model.ratingobject.uid
source: Ratingobject configurations
de: Bewertungsobjekt Konfigurationen

# tca.model.ratingobject.title
source: RatingObjects
de: Bewertungsobjekt

# tca.model.ratingobject.ratings
source: Ratings
de: Bewertungen

# tca.model.ratingobject.stepconfs
source: Retingstep configuration
de: Bewertungskonfiguration

# tca.model.stepconf.ratingobject
source: Rating Object
de: Bewertungsobjekt

# tca.model.stepconf.steporder
source: Ratingstep order
de: Bewertung Reihenfolge

# tca.model.stepconf.stepweight
source: Ratingstep weight
de: Bewertung Gewichtung

# tca.model.stepconf.stepname
source: Ratingstep names
de: Ratingstep Bezeichnungen

# tca.model.stepconf.votes
source: Assigned votes
de: Bewertungen

# tca.model.stepconf.uid
source: Ratingstep configuration list
de: UID des Bewertungsschritts

# tca.model.stepconf.title
source: Ratingstep configuration
de: Bewertungskonfiguration

# tca.model.stepname.title
source: Ratingstep name
de: Ratingstep Bezeichnung

# tca.model.stepname.stepconf
source: Ratingstep configuration
de: Bewertungskonfiguration

# tca.model.stepname.stepname
source: Ratingstep name
de: Ratingstep Bezeichnung

# tca.model.stepname.uid
source: Ratingstep name list
de: Ratingstep Bezeichnungen

# tca.model.vote.rating
source: Rating
de: Bewertetes Objekt

# tca.model.vote.voter
source: FE User
de: Bewertende Person

# tca.model.vote.vote
source: Vote
de: Bewertung

# tca.model.vote.uid
source: Vote list
de: UID der Bewertung

# tca.model.vote.title
source: Votings
de: Bewertungen

# flash.vote.general.invalidStoragePid
source: Constant "plugin.tx_thrating.settings.pluginStoragePid" is not set.
de: Die Konstante "plugin.tx_thrating.settings.pluginStoragePid" muss konfiguriert werden.

# flash.pluginConfiguration.missing.feUserStoragePid
source: "plugin.tx_felogin_pi1.storagePid" not set.
de: "plugin.tx_felogin_pi1.storagePid" ist nicht gesetzt.

# flash.pluginConfiguration.missing.feUser
source: Configured frontend user (uid: %s) could not be determinded. Please check 'plugin.tx_thrating.feUsersStoragePid' and uid.
de: Konfigurierter Frontend-Benutzer (uid: %s) konnte nicht ermittelt werden. Bitte überprüfen Sie 'plugin.tx_thrating.feUsersStoragePid' und uid.

# flash.pluginConfiguration.missing.anonymousUser
source: Configured anonymous user (uid: %s) could not be determined. Please check 'plugin.tx_thrating.feUsersStoragePid' and/or constant setting 'plugin.tx_thrating.config.mapAnonymous'.
de: Der konfigurierte anonyme Benutzer (uid: %s) konnte nicht ermittelt werden. Bitte überprüfen Sie „plugin.tx_thrating.feUsersStoragePid“ und/oder setzen Sie die Konstante „plugin.tx_thrating.config.mapAnonymous“.

# error.validator.ratingobject_table_extbase
source: Missing table name in ratingobject.
de: Fehlender Tabellenname ín Ratingobject.

# error.validator.ratingobject_field_extbase
source: Missing field name in ratingobject.
de: Fehlender Feldbezeichner in Ratingobject.

# error.validator.stepconf.ratingobject
source: Missing ratingobject in stepconf.
de: Fehlerndes Ratingobject in Stepconf.

# error.validator.stepconf.steps
source: Missing steps in stepconf.
de: Fehlende Stufen in Stepconf.

# error.validator.stepconf.invalidSteporderNumber
source: Invalid number in steporder. Must be of positive integer.
de: Nummer bei Steporder muss positive Ganzzahl sein.

# error.validator.stepconf.maxSteporder
source: Steporder too high. Maximum steporder number + 1 is allowed.
de: Nummer bei Steporder zu groß. Maximal höchste Steporder + 1 erlaubt.

# error.validator.stepconf.defaultStepname
source: Missing stepname entry for default language in stepconf %s.
de: Fehlender Eintrag beim Schrittnamen für die Standardsprache in Stepconf %s.

# error.validator.stepconf.doubleLangEntry
source: Multiple stepnames for one language in stepconf %s.
de: Mehrere Schrittbezeichnungen für eine Sprache bei Stepconf %s.

# error.validator.stepconf.notExistingLanguage
source: Stepname %s one language does not exist in this website.
de: Eine Übersetzung bei Schrittbezeichnung %s existiert nicht in dieser Website.

# error.validator.stepconf.empty
source: Empty stepconf
de: Leere Bewertungskonfiguration

# error.validator.rating.ratedobjectuid
source: Missing UID in rating.
de: Fehlende UID in Rating.

# error.validator.rating.ratingobject
source: False ratingobject in rating
de: Falsches Ratingobject in Rating

# error.validator.rating.empty
source: Empty rating
de: Leeres Rating

# error.validator.vote.vote
source: Missing vote
de: Keine Bewertung

# error.validator.vote.voter
source: False voter reference in vote
de: Falsche Bewerterreferenz in Vote

# error.validator.vote.stepconf
source: False voting reference in vote
de: Falsche Bewertungsreferenz in Vote

# error.validator.vote.empty
source: Empty vote
de: Leere Bewertung

# error.validator.stepname.stepconf
source: False stepconf reference in stepname
de: Falsche Referenz auf Bewertungsschritt

# error.validator.stepname.sysLang
source: Language does not exist in website configuration
de: Sprache existiert nicht in Konfiguration der Website

# error.validator.stepname.defaultLang
source: Missing entry for default language
de: Fehlende Referenz mit Standardsprache

# error.richSnippetConfiguration.AggregateRatingPropertySchema
source: An invalid schema has been configured. Usage of aggregateRating property is limited. Check http://schema.org/aggregateRating for valid types.
de: Ein ungültiges Schema für aggregateRating ist konfiguriert. Gültige Typen in http://schema.org/aggregateRating prüfen.

# flash.ratingobject.noRatingsteps
source: No ratingsteps configured!
de: Ratingsteps fehlen!

# flash.vote.noFEuser
source: FE user cannot be identified!
de: Benutzer nicht identifizierbar!

# flash.vote.renderCSS.defaultImage
source: Issue found with configuration for rating display - using default image.
de: Fehler in Konfiguration für die Ratinganzeige gefunden - verwende Standardbild.

# flash.vote.show.notRated
source: Not already rated
de: Noch unbewertet

# flash.vote.ratinglinks.wrongDisplayConfig
source: Check TSConfig setting for 'display name'.
de: Prüfe TSConfig Einstellungen für 'display name'.

# flash.vote.create.noPermission
source: No permission for this action.
de: Du hast keine Berechtigung um die Aktion auszuführen.

# flash.heading.error
source: Error !!!!
de: Fehler !!!!

# flash.configuration.error
source: Error in configuration of extension 'Rating AX'
de: Fehler in der Konfiguration der Erweiterung 'Rating AX'

# flash.heading.warning
source: Warning!
de: Achtung!

# flash.heading.notice
source: Notification
de: Hinweis

# flash.heading.ok
source: Success
de: Verarbeitung erfolgreich

# flash.renderCSS.noStepconf
source: Stepconf missing in ratingobject configuration of UID %1$s - check PID %2$s.
de: Fehlende Bewertungsschritt(e) beim Bewertungsobjekt mit der UID %1$s - prüfe PID %2$s.

# flash.renderCSS.incompatible620
source: Incompatible version - please upgrade to at least TYPO3 6.2.1
de: Inkompatible Version - upgrade auf mindestens TYPO3 6.2.1 nötig

# flash.vote.create.updateExistingVote
source: Your vote has been updated. It was step %1$d - '%2$s'.
de: Die Bewertung wurde aktualisiert. Sie war %1$d - '%2$s'.

# flash.vote.create.noUpdateSameVote
source: Your vote is identical as before. No update needed.
de: Die Bewertung wurde nicht geändert. Keine Aktualisierung nötig.

# flash.vote.create.alreadyRated
source: Already rated.
de: Du hast bereits eine Bewertung vorgenommen.

# flash.vote.create.newCreated
source: Your new vote was created.
de: Die Stimme wurde gezählt.

# flash.vote.create.foreignUpdateFailed
source: Update of foreign field has failed.
de: Update der Fremdtabelle fehlgeschlagen.

# fluid.template.ratinglinks.currentRating
source: Current rating is <span class='tx_thrating_ajax-ratingCurrentratesCurrentrate' itemprop='ratingValue'>%1.1f</span> out of <span class='tx_thrating_ajax-stepCount' itemprop='bestRating'>%2$d</span>
de: Aktuelle Bewertung &lt;span class='tx_thrating_ajax-ratingCurrentratesCurrentrate' itemprop='ratingValue'&gt;%1.1f&lt;/span&gt; von &lt;span class='tx_thrating_ajax-stepCount' itemprop='bestRating'&gt;%2$d&lt;/span&gt;

# fluid.layout.default.currentRating
source: Rating: <span class='tx_thrating_ajax-ratingCurrentratesCurrentrate' itemprop='ratingValue'>%1.1f</span>. <span class='tx_thrating_ajax-ratingCurrentratesNumAllVotes' itemprop='ratingCount'>%2$d</span> vote(s).
de: Bewertung: &lt;span class='tx_thrating_ajax-ratingCurrentratesCurrentrate' itemprop='ratingValue'&gt;%1.1f&lt;/span&gt;. &lt;span class='tx_thrating_ajax-ratingCurrentratesNumAllVotes' itemprop='ratingCount'&gt;%2$d&lt;/span&gt; Bewertung(en).

# fluid.layout.default.anonymousVotes
source: <span class='tx_thrating_ajax-ratingCurrentratesAnonymousVotes'>%1$d</span> anonymous votes
de: &lt;span class='tx_thrating_ajax-ratingCurrentratesAnonymousVotes'&gt;%1$d&lt;/span&gt; anonyme Bewertungen

# fluid.layout.default.noRatingDone
source: No rating done at all.
de: Noch keine Bewertung erfolgt.

# fluid.partial.usersRating.usersRate
source: Your vote was '<span class='tx_thrating_ajax-votingStepname'>%1$s</span>' (<span class='tx_thrating_ajax-votingVoteSteporder'>%2$d</span> of <span class='tx_thrating_ajax-stepCount'>%3$d</span>)
de: Deine Bewertung war '&lt;span class='tx_thrating_ajax-votingStepname'&gt;%1$s&lt;/span&gt;' (&lt;span class='tx_thrating_ajax-votingVoteSteporder'&gt;%2$d&lt;/span&gt; von &lt;span class='tx_thrating_ajax-stepCount'&gt;%3$d&lt;/span&gt;)

# fluid.partial.usersRating.noRating
source: No rating done yet.
de: Noch keine Bewertung erfolgt.

# fluid.partial.infoBlock.anonymousVoting
source: You are an anonymous user.<br/>You may log on to do personalized votings<br/>
de: Du arbeitest aktuell als anonymer Benutzer.&lt;br/&gt;Melde Dich für personalisierte Bewertungen an.&lt;br/&gt;

# fluid.partial.infoBlock.logonForRatings
source: Please log on to do ratings
de: Melde Dich bitte an, um zu bewerten

# fluid.layout.default.noRatingSteps
source: No ratingsteps configured.
de: Keine Bewertungsschritte konfiguriert.

# fluid.partial.infoBlock.clickRatingBar
source: Click the rating bar to rate this item
de: Klicke in die Bewertungsleiste
